{"pageProps":{"rule":{"metadata":{"updated_date":"2026-05-18T13:28:34.000Z","source_siem":"Google Chronicle","source_siem_id":"chronicle","source_url":"https://github.com/chronicle/detection-rules/blob/main/rules/_deprecated/soc_prime_rules/threat_hunting/process_creation/activity_related_to_ntds_dit_domain_hash_retrieval.yaral"},"rule":{"name":"activity related to ntdsdit domain hash retrieval","description":"Detects suspicious commands that could be related to activity that uses volume shadow copy to steal and retrieve hashes from the NTDS.dit file remotely  License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md.","tags":["Rule Type: YARA-L","Domain: Cloud","Data Source: Google SecOps","SIEM: Google Chronicle"],"severity":"medium","risk_score":47,"type":"yara-l","language":"yara-l","query":"rule activity_related_to_ntdsdit_domain_hash_retrieval {\n meta:\n    author = \"Florian Roth, Michael Haag\"\n    description = \"Detects suspicious commands that could be related to activity that uses volume shadow copy to steal and retrieve hashes from the NTDS.dit file remotely  License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md.\"\n    reference = \"https://tdm.socprime.com/tdm/info/Rp79M4izVSNy\"\n    version = \"0.01\"\n    created = \"2021-03-09\"\n    category = \"process_creation\"\n    product = \"windows\"\n    mitre = \"credential_access, t1003\"\n\n  events:\n(($selection.target.process.command_line = \"vssadmin.exe Delete Shadows\" or $selection.target.process.command_line = \"vssadmin create shadow /for=C:\" or re.regex($selection.target.process.command_line, `copy \\\\\\\\\\?\\\\GLOBALROOT\\\\Device\\\\.*\\\\windows\\\\ntds\\\\ntds\\.dit`) or re.regex($selection.target.process.command_line, `copy \\\\\\\\\\?\\\\GLOBALROOT\\\\Device\\\\.*\\\\config\\\\SAM`) or $selection.target.process.command_line = \"vssadmin delete shadows /for=C:\" or $selection.target.process.command_line = \"reg SAVE HKLM\\\\SYSTEM \" or re.regex($selection.target.process.command_line, `esentutl\\.exe /y /vss .*\\\\ntds\\.dit.*`)) and ($selection.metadata.product_event_type = \"4688\" or $selection.metadata.product_event_type = \"1\"))\n\n  condition:\n    $selection\n}\n","reference":["https://tdm.socprime.com/tdm/info/Rp79M4izVSNy"],"false_positives":[]}}},"__N_SSG":true}