{"pageProps":{"rule":{"metadata":{"updated_date":"2026-05-18T13:28:34.000Z","source_siem":"Google Chronicle","source_siem_id":"chronicle","source_url":"https://github.com/chronicle/detection-rules/blob/main/rules/_deprecated/soc_prime_rules/threat_hunting/process_creation/detection_of_winrs_usage.yaral"},"rule":{"name":"detection of winrs usage","description":"Windows Remote Shell (WinRS) is a command line tool that is part of Windows 2008 and later. If WinRM is enabled this utility can be used to execute commands on a host remotely.  License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md.","tags":["Rule Type: YARA-L","Domain: Cloud","Data Source: Google SecOps","SIEM: Google Chronicle"],"severity":"medium","risk_score":47,"type":"yara-l","language":"yara-l","query":"rule detection_of_winrs_usage {\n meta:\n    author = \"Sreeman\"\n    description = \"Windows Remote Shell (WinRS) is a command line tool that is part of Windows 2008 and later. If WinRM is enabled this utility can be used to execute commands on a host remotely.  License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md.\"\n    reference = \"https://tdm.socprime.com/tdm/info/anp657rEE5hG\"\n    version = \"0.01\"\n    created = \"2021-03-09\"\n    category = \"process_creation\"\n    product = \"windows\"\n    mitre = \"lateral movement, execution, t1028\"\n\n  events:\n(($selection.target.process.command_line = \"winrs -r\" or $selection.target.process.command_line = \"winrs /r\") and ($selection.metadata.product_event_type = \"4688\" or $selection.metadata.product_event_type = \"1\"))\n\n  condition:\n    $selection\n}\n","reference":["https://tdm.socprime.com/tdm/info/anp657rEE5hG"],"false_positives":[]}}},"__N_SSG":true}