{"pageProps":{"rule":{"metadata":{"updated_date":"2026-05-18T13:28:34.000Z","source_siem":"Google Chronicle","source_siem_id":"chronicle","source_url":"https://github.com/chronicle/detection-rules/blob/main/rules/_deprecated/soc_prime_rules/threat_hunting/process_creation/lolbas_wsl_exe__via_cmdline.yaral"},"rule":{"name":"lolbas wslexe via cmdline","description":"Detects usage of wsl.exe  License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md.","tags":["Rule Type: YARA-L","Domain: Cloud","Data Source: Google SecOps","SIEM: Google Chronicle"],"severity":"medium","risk_score":47,"type":"yara-l","language":"yara-l","query":"rule lolbas_wslexe_via_cmdline {\n meta:\n    author = \"Den Iuzvyk\"\n    description = \"Detects usage of wsl.exe  License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md.\"\n    reference = \"https://tdm.socprime.com/tdm/info/O189cebA03ON\"\n    version = \"0.01\"\n    created = \"2021-03-09\"\n    category = \"process_creation\"\n    product = \"windows\"\n    mitre = \"execution, t1204, T1202\"\n\n  events:\n(($selection1.metadata.product_event_type = \"4688\" or $selection1.metadata.product_event_type = \"1\") and (re.regex($selection1.principal.process.file.full_path, `.*\\\\wsl\\.exe`) or (re.regex($selection1.target.process.file.full_path, `.*\\\\wsl\\.exe`) and (re.regex($selection1.target.process.command_line, `.*--exec.*`) or re.regex($selection1.target.process.command_line, `.*-e.*`) or re.regex($selection1.target.process.command_line, `.*-u.*`)))))\n\n  condition:\n    $selection1\n}\n","reference":["https://tdm.socprime.com/tdm/info/O189cebA03ON"],"false_positives":[]}}},"__N_SSG":true}