{"pageProps":{"rule":{"metadata":{"updated_date":"2026-05-18T13:28:34.000Z","source_siem":"Google Chronicle","source_siem_id":"chronicle","source_url":"https://github.com/chronicle/detection-rules/blob/main/rules/_deprecated/soc_prime_rules/ioc_sigma/windows/turla_backdoor__sysmon.yaral"},"rule":{"name":"turla backdoor sysmon","description":"Turla Backdoor Detector.  License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md.","tags":["Rule Type: YARA-L","Domain: Cloud","Data Source: Google SecOps","SIEM: Google Chronicle"],"severity":"medium","risk_score":47,"type":"yara-l","language":"yara-l","query":"rule turla_backdoor_sysmon {\n meta:\n    author = \"Dmitriy Dyakon, SOC Prime\"\n    description = \"Turla Backdoor Detector.  License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md.\"\n    reference = \"https://tdm.socprime.com/tdm/info/vYABlVudO8eM\"\n    version = \"0.01\"\n    created = \"2018/01/02\"\n    product = \"windows\"\n    service = \"sysmon\"\n    mitre = \"T1064, T1100, Command and Control\"\n\n  events:\n($selection_hashes.metadata.product_event_type = \"1\" and ($selection_hashes.target.file.md5 = \"fd898c5a4cd57c3e9cef41f6fd4f71a7\" or $selection_hashes.target.file.md5 = \"9dab3dd7b7e7f4980397da908fbc9ff7\" or $selection_hashes.target.file.md5 = \"3eb5f44492ce1147790450d950954a52\"))\n\n  condition:\n    $selection_hashes\n}\n","reference":["https://tdm.socprime.com/tdm/info/vYABlVudO8eM"],"false_positives":[]}}},"__N_SSG":true}