{"pageProps":{"rule":{"metadata":{"updated_date":"2026-05-18T13:28:34.000Z","source_siem":"Google Chronicle","source_siem_id":"chronicle","source_url":"https://github.com/chronicle/detection-rules/blob/main/rules/_deprecated/soc_prime_rules/ioc_sigma/process_creation/wastedlocker_ransomware_hunting__initial_access_and_compromise.yaral"},"rule":{"name":"wastedlocker ransomware hunting initial access and compromise","description":"This rule its part of Cisco Talos investigation about this ransomware, and includes a lot of ATT&CK techniques that i'll be writing in different rules.  License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md.","tags":["Rule Type: YARA-L","Domain: Cloud","Data Source: Google SecOps","SIEM: Google Chronicle"],"severity":"medium","risk_score":47,"type":"yara-l","language":"yara-l","query":"rule wastedlocker_ransomware_hunting_initial_access_and_compromise {\n meta:\n    author = \"Ariel Millahuel\"\n    description = \"This rule its part of Cisco Talos investigation about this ransomware, and includes a lot of ATT&CK techniques that i'll be writing in different rules.  License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md.\"\n    reference = \"https://tdm.socprime.com/tdm/info/cexuKikgrGxH\"\n    version = \"0.01\"\n    created = \"2021-03-09\"\n    category = \"process_creation\"\n    product = \"windows\"\n    mitre = \"initial_access, T1189\"\n\n  events:\n($selection1.target.process.file.full_path = \"wscript.exe\" and re.regex($selection1.target.process.command_line, `wscript\\.exe C:\\\\Users.*\\\\AppData\\\\Local\\\\Temp\\\\Temp1_Chrome\\.Update\\.b343b0\\.zip\\\\Chrome\\.Update\\.c9a747\\.js`) and ($selection1.metadata.product_event_type = \"4688\" or $selection1.metadata.product_event_type = \"1\"))\n\n  condition:\n    $selection1\n}\n","reference":["https://tdm.socprime.com/tdm/info/cexuKikgrGxH"],"false_positives":[]}}},"__N_SSG":true}