{"pageProps":{"rule":{"metadata":{"updated_date":"2026-05-18T13:28:34.000Z","source_siem":"Google Chronicle","source_siem_id":"chronicle","source_url":"https://github.com/chronicle/detection-rules/blob/main/rules/_deprecated/soc_prime_rules/ioc_sigma/windows/wsf_jse_js_vba_vbe_file_execution__sysmon.yaral"},"rule":{"name":"wsfjsejsvbavbe file execution sysmon","description":"Detects suspicious file execution by wscript and cscript.  License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md.","tags":["Rule Type: YARA-L","Domain: Cloud","Data Source: Google SecOps","SIEM: Google Chronicle"],"severity":"medium","risk_score":47,"type":"yara-l","language":"yara-l","query":"rule wsfjsejsvbavbe_file_execution_sysmon {\n meta:\n    author = \"Michael Haag, Alexandr Yampolskyi\"\n    description = \"Detects suspicious file execution by wscript and cscript.  License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md.\"\n    reference = \"https://tdm.socprime.com/tdm/info/KOI4etWKDUTa\"\n    version = \"0.01\"\n    created = \"2021-03-09\"\n    product = \"windows\"\n    service = \"sysmon\"\n    mitre = \"Execution, t1059, t1204\"\n\n  events:\n($selection.metadata.product_event_type = \"1\" and (re.regex($selection.target.process.file.full_path, `.*wscript\\.exe`) or re.regex($selection.target.process.file.full_path, `.*cscript\\.exe`)) and (re.regex($selection.target.process.command_line, `.*\\.jse.*`) or re.regex($selection.target.process.command_line, `.*\\.vbe.*`) or re.regex($selection.target.process.command_line, `.*\\.js.*`) or re.regex($selection.target.process.command_line, `.*\\.vba.*`)))\n\n  condition:\n    $selection\n}\n","reference":["https://tdm.socprime.com/tdm/info/KOI4etWKDUTa"],"false_positives":[]}}},"__N_SSG":true}