{"pageProps":{"rule":{"metadata":{"updated_date":"2026-05-18T13:28:34.000Z","source_siem":"Google Chronicle","source_siem_id":"chronicle","source_url":"https://github.com/chronicle/detection-rules/blob/main/rules/_deprecated/soc_prime_rules/threat_hunting/process_creation/apt29_part_1.yaral"},"rule":{"name":"apt29","description":"This method detects a suspicious powershell command line combination as used by APT29 in a campaign against US think tanks  License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md.","tags":["Rule Type: YARA-L","Domain: Cloud","Data Source: Google SecOps","SIEM: Google Chronicle"],"severity":"medium","risk_score":47,"type":"yara-l","language":"yara-l","query":"rule apt29 {\n meta:\n    author = \"Florian Roth\"\n    description = \"This method detects a suspicious powershell command line combination as used by APT29 in a campaign against US think tanks  License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md.\"\n    reference = \"https://tdm.socprime.com/tdm/info/EID3KC4B5JxZ\"\n    version = \"0.01\"\n    created = \"2018/12/04\"\n    product = \"windows\"\n    service = \"sysmon\"\n\n  events:\n($selection.metadata.product_event_type = \"1\" and re.regex($selection.target.process.command_line, `.*-noni -ep bypass $.*`))\n\n  condition:\n    $selection\n}\n","reference":["https://tdm.socprime.com/tdm/info/EID3KC4B5JxZ"],"false_positives":[]}}},"__N_SSG":true}