{"pageProps":{"rule":{"metadata":{"updated_date":"2026-05-18T13:28:34.000Z","source_siem":"Google Chronicle","source_siem_id":"chronicle","source_url":"https://github.com/chronicle/detection-rules/blob/main/rules/_deprecated/soc_prime_rules/ioc_sigma/windows/keylogger_detector__sysmon.yaral"},"rule":{"name":"keylogger detector sysmon","description":"keylogger is a simple standalone executable that sets global keyboard hooks and writes all keystrokes into a file in an encrypted form.  License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md.","tags":["Rule Type: YARA-L","Domain: Cloud","Data Source: Google SecOps","SIEM: Google Chronicle"],"severity":"medium","risk_score":47,"type":"yara-l","language":"yara-l","query":"rule keylogger_detector_sysmon {\n meta:\n    author = \"Alexandr Yampolskyi, SOC Prime\"\n    description = \"keylogger is a simple standalone executable that sets global keyboard hooks and writes all keystrokes into a file in an encrypted form.  License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md.\"\n    reference = \"https://tdm.socprime.com/tdm/info/w9X8xmoNK3LJ\"\n    version = \"0.01\"\n    created = \"2018/06/01\"\n    product = \"windows\"\n    service = \"sysmon\"\n    mitre = \"Execution, t1204\"\n\n  events:\n($selection.metadata.product_event_type = \"1\" and ($selection.target.file.md5 = \"21921864D2F1AB2761C36031A2E1D2C00C9B304A\" or $selection.target.file.md5 = \"3C2D0615BEF6F88FED6E308D4F45B6133080C74F\" or $selection.target.file.md5 = \"91E8346910E0E6783ACFC4F2B9A745C81BD7573A\"))\n\n  condition:\n    $selection\n}\n","reference":["https://tdm.socprime.com/tdm/info/w9X8xmoNK3LJ"],"false_positives":[]}}},"__N_SSG":true}