{"pageProps":{"rule":{"metadata":{"updated_date":"2026-05-18T13:28:34.000Z","source_siem":"Google Chronicle","source_siem_id":"chronicle","source_url":"https://github.com/chronicle/detection-rules/blob/main/rules/_deprecated/soc_prime_rules/threat_hunting/process_creation/detect_possible_execution_of_phishing_attachment.yaral"},"rule":{"name":"detect possible execution of phishing attachment","description":"This rule detects when a process is created from the execution of a possible malicoius email attachment sent as malspam or spear phishing attempts based on the most prevalent naming techniques and extensions.This rule would be ideal for hunting for phishing attacks that would have gone undetected  License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md.","tags":["Rule Type: YARA-L","Domain: Cloud","Data Source: Google SecOps","SIEM: Google Chronicle"],"severity":"medium","risk_score":47,"type":"yara-l","language":"yara-l","query":"rule detect_possible_execution_of_phishing_attachment {\n meta:\n    author = \"Joseph Kamau\"\n    description = \"This rule detects when a process is created from the execution of a possible malicoius email attachment sent as malspam or spear phishing attempts based on the most prevalent naming techniques and extensions.This rule would be ideal for hunting for phishing attacks that would have gone undetected  License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md.\"\n    reference = \"https://tdm.socprime.com/tdm/info/eQp3NR1Vg8pm\"\n    version = \"0.01\"\n    created = \"2021-03-09\"\n    product = \"windows\"\n    category = \"process_creation\"\n    mitre = \"initial_access, t1566, t1566.001, t1566.002\"\n\n  events:\n((re.regex($selection.target.process.command_line, `.*.*pdf\\.exe`) or re.regex($selection.target.process.command_line, `.*.*pdf\\.zip`) or re.regex($selection.target.process.command_line, `.*.*pdf\\.7zp`) or re.regex($selection.target.process.command_line, `.*\\\\order.*\\.jar`) or re.regex($selection.target.process.command_line, `.*\\\\payment.*\\.jar`) or re.regex($selection.target.process.command_line, `.*\\\\shipping.*\\.exe`) or re.regex($selection.target.process.command_line, `.*\\\\shipping.*\\.jar`) or re.regex($selection.target.process.command_line, `.*\\\\purchase.*\\.jar`) or re.regex($selection.target.process.command_line, `.*.*\\.arj`) or re.regex($selection.target.process.command_line, `.*.*\\.xz`) or re.regex($selection.target.process.command_line, `.*.*pdf\\.gz`) or re.regex($selection.target.process.command_line, `.*\\\\quotation.*\\.jar`) or re.regex($selection.target.process.command_line, `.*\\\\order.*\\.zip`) or re.regex($selection.target.process.command_line, `.*.*xls\\.zip`) or re.regex($selection.target.process.command_line, `.*\\\\swift.*\\.jar`) or re.regex($selection.target.process.command_line, `.*\\\\invoice.*\\.jar`) or re.regex($selection.target.process.command_line, `.*\\\\invoice.*\\.exe`) or re.regex($selection.target.process.command_line, `.*\\\\shipping advice.*\\.exe`) or re.regex($selection.target.process.command_line, `.*\\\\shipping advice.*\\.jar`) or re.regex($selection.target.process.command_line, `.*\\\\Airway bill.*\\.exe`) or re.regex($selection.target.process.command_line, `.*\\\\Airway bill.*\\.jar`) or re.regex($selection.target.process.command_line, `.*\\\\DHL.*\\.exe`) or re.regex($selection.target.process.command_line, `.*\\\\Corona.*\\.exe`) or re.regex($selection.target.process.command_line, `.*\\\\Covid.*\\.exe`) or re.regex($selection.target.process.command_line, `.*\\\\corona.*\\.doc`) or re.regex($selection.target.process.command_line, `.*\\\\covid.*\\.doc`) or re.regex($selection.target.process.command_line, `.*.*\\.bat\\.rar`) or re.regex($selection.target.process.command_line, `.*.*\\.zip\\.xxe`) or re.regex($selection.target.process.command_line, `.*.*\\.xlsx\\.swf`) or re.regex($selection.target.process.command_line, `.*\\\\PO`) or re.regex($selection.target.process.command_line, `.*\\\\Invoice`)) and ($selection.metadata.product_event_type = \"4688\" or $selection.metadata.product_event_type = \"1\"))\n\n  condition:\n    $selection\n}\n","reference":["https://tdm.socprime.com/tdm/info/eQp3NR1Vg8pm"],"false_positives":[]}}},"__N_SSG":true}