{"pageProps":{"rule":{"metadata":{"updated_date":"2026-05-18T13:28:34.000Z","source_siem":"Google Chronicle","source_siem_id":"chronicle","source_url":"https://github.com/chronicle/detection-rules/blob/main/rules/_deprecated/soc_prime_rules/threat_hunting/process_creation/hiding_files_with_attrib_exe.yaral"},"rule":{"name":"hiding files with attribexe","description":"Detects usage of attrib.exe to hide files from users.  License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md.","tags":["Rule Type: YARA-L","Domain: Cloud","Data Source: Google SecOps","SIEM: Google Chronicle"],"severity":"medium","risk_score":47,"type":"yara-l","language":"yara-l","query":"rule hiding_files_with_attribexe {\n meta:\n    author = \"Sami Ruohonen\"\n    description = \"Detects usage of attrib.exe to hide files from users.  License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md.\"\n    reference = \"https://tdm.socprime.com/tdm/info/jQlXqmmOmwCE\"\n    version = \"0.01\"\n    created = \"2021-03-09\"\n    category = \"process_creation\"\n    product = \"windows\"\n    mitre = \"defense_evasion, persistence, t1158\"\n\n  events:\n((re.regex($selection.target.process.file.full_path, `.*\\\\attrib\\.exe`) and re.regex($selection.target.process.command_line, `.* \\+h .*`) and ($selection.metadata.product_event_type = \"4688\" or $selection.metadata.product_event_type = \"1\")) and not ((re.regex($selection.target.process.command_line, `.*\\\\desktop\\.ini .*`) or (re.regex($selection.principal.process.file.full_path, `.*\\\\cmd\\.exe`) and re.regex($selection.target.process.command_line, `\\+R \\+H \\+S \\+A \\\\.*\\.cui`) and re.regex($selection.principal.process.command_line, `C:\\\\WINDOWS\\\\system32\\\\.*\\.bat`)))))\n\n  condition:\n    $selection\n}\n","reference":["https://tdm.socprime.com/tdm/info/jQlXqmmOmwCE"],"false_positives":[]}}},"__N_SSG":true}