{"pageProps":{"rule":{"metadata":{"updated_date":"2026-04-20T16:36:48.000Z","source_siem":"Google Chronicle","source_siem_id":"chronicle","source_url":"https://github.com/chronicle/detection-rules/blob/main/rules/_deprecated/soc_prime_rules/threat_hunting/process_creation/windows_10_scheduled_task_sandboxescaper_0_day.yaral"},"rule":{"name":"windows 10 scheduled task sandboxescaper 0day","description":"Detects Task Scheduler .job import arbitrary DACL write\\\\par  License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md.","tags":["Rule Type: YARA-L","Domain: Cloud","Data Source: Google SecOps","SIEM: Google Chronicle"],"severity":"medium","risk_score":47,"type":"yara-l","language":"yara-l","query":"rule windows_10_scheduled_task_sandboxescaper_0day {\n meta:\n    author = \"Olaf Hartong\"\n    description = \"Detects Task Scheduler .job import arbitrary DACL write\\\\par  License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md.\"\n    reference = \"https://tdm.socprime.com/tdm/info/HcfelKJbUzFI\"\n    version = \"0.01\"\n    created = \"2019/05/22\"\n    category = \"process_creation\"\n    product = \"windows\"\n    mitre = \"privilege_escalation, execution, t1053, car.2013-08-001\"\n\n  events:\n($selection.target.process.file.full_path = \"schtasks.exe\" and re.regex($selection.target.process.command_line, `.*/change.*/TN.*/RU.*/RP.*`) and ($selection.metadata.product_event_type = \"4688\" or $selection.metadata.product_event_type = \"1\"))\n\n  condition:\n    $selection\n}\n","reference":["https://tdm.socprime.com/tdm/info/HcfelKJbUzFI"],"false_positives":[]}}},"__N_SSG":true}