{"pageProps":{"rule":{"metadata":{"updated_date":"2026-04-20T16:36:48.000Z","source_siem":"Google Chronicle","source_siem_id":"chronicle","source_url":"https://github.com/chronicle/detection-rules/blob/main/rules/_deprecated/info/file_write_by_hash.yaral"},"rule":{"name":"info file write by hash","description":"File writing events based on the file's hash value","tags":["Rule Type: YARA-L","Domain: Cloud","Data Source: Google SecOps","SIEM: Google Chronicle"],"severity":"medium","risk_score":47,"type":"yara-l","language":"yara-l","query":"/*\n * Copyright 2021 Google LLC\n *\n * Licensed under the Apache License, Version 2.0 (the \"License\");\n * you may not use this file except in compliance with the License.\n * You may obtain a copy of the License at\n *\n *     https://www.apache.org/licenses/LICENSE-2.0\n *\n * Unless required by applicable law or agreed to in writing, software\n * distributed under the License is distributed on an \"AS IS\" BASIS,\n * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.\n * See the License for the specific language governing permissions and\n * limitations under the License.\n */\n\nrule info_file_write_by_hash\n{\n  meta:\n    author = \"Google Cloud Security\"\n    description = \"File writing events based on the file's hash value\"\n    yara_version = \"YL2.0\"\n    rule_version = \"1.0\"\n\n  events:\n    $e1.metadata.event_type = \"FILE_MODIFICATION\"\n    $e1.target.file.sha256 = \"199b3890d28a1f5906f4014e73615a268b3c4414f1f71697bf13e0d464258d54\"\n\n  condition:\n    $e1\n}\n","reference":[],"false_positives":[]}}},"__N_SSG":true}