{"pageProps":{"rule":{"metadata":{"updated_date":"2026-04-20T16:36:48.000Z","source_siem":"Google Chronicle","source_siem_id":"chronicle","source_url":"https://github.com/chronicle/detection-rules/blob/main/rules/_deprecated/soc_prime_rules/threat_hunting/linux/program_executions_in_suspicious_folders.yaral"},"rule":{"name":"program executions in suspicious folders","description":"Detects program executions in suspicious non-program folders related to malware or hacking activity  License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md.","tags":["Rule Type: YARA-L","Domain: Cloud","Data Source: Google SecOps","SIEM: Google Chronicle"],"severity":"medium","risk_score":47,"type":"yara-l","language":"yara-l","query":"rule program_executions_in_suspicious_folders {\n meta:\n    author = \"Florian Roth\"\n    description = \"Detects program executions in suspicious non-program folders related to malware or hacking activity  License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md.\"\n    reference = \"https://tdm.socprime.com/tdm/info/7Kk4Ni7briER\"\n    version = \"0.01\"\n    created = \"2018/01/23\"\n    product = \"linux\"\n    service = \"auditd\"\n\n  events:\n($selection.metadata.event_type = \"SYSCALL\" and (re.regex($selection.target.process.file.full_path, `/tmp/.*`) or re.regex($selection.target.process.file.full_path, `/var/www/.*`) or re.regex($selection.target.process.file.full_path, `/usr/local/apache2/.*`) or re.regex($selection.target.process.file.full_path, `/usr/local/httpd/.*`) or re.regex($selection.target.process.file.full_path, `/var/apache/.*`) or re.regex($selection.target.process.file.full_path, `/srv/www/.*`) or re.regex($selection.target.process.file.full_path, `/home/httpd/html/.*`) or re.regex($selection.target.process.file.full_path, `/var/lib/pgsql/data/.*`) or re.regex($selection.target.process.file.full_path, `/usr/local/mysql/data/.*`) or re.regex($selection.target.process.file.full_path, `/var/lib/mysql/.*`) or re.regex($selection.target.process.file.full_path, `/var/vsftpd/.*`) or re.regex($selection.target.process.file.full_path, `/etc/bind/.*`) or re.regex($selection.target.process.file.full_path, `/var/named/.*`) or re.regex($selection.target.process.file.full_path, `.*/public_html/.*`)))\n\n  condition:\n    $selection\n}\n","reference":["https://tdm.socprime.com/tdm/info/7Kk4Ni7briER"],"false_positives":[]}}},"__N_SSG":true}