{"pageProps":{"rule":{"metadata":{"updated_date":"2026-04-20T16:36:48.000Z","source_siem":"Google Chronicle","source_siem_id":"chronicle","source_url":"https://github.com/chronicle/detection-rules/blob/main/rules/_deprecated/soc_prime_rules/threat_hunting/microsoft_sysmon/suspicious_schtasks_creation__possible_windows_0day_lpe_aka__polarbear__by_sandboxescaper.yaral"},"rule":{"name":"suspicious schtasks creation possible windows 0day lpe aka polarbear by sandboxescaper","description":"Possible task scheduler .job import arbitrary DACL write.  License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md.","tags":["Rule Type: YARA-L","Domain: Cloud","Data Source: Google SecOps","SIEM: Google Chronicle"],"severity":"medium","risk_score":47,"type":"yara-l","language":"yara-l","query":"rule suspicious_schtasks_creation_possible_windows_0day_lpe_aka_polarbear_by_sandboxescaper {\n meta:\n    author = \"Roman Ranskyi\"\n    description = \"Possible task scheduler .job import arbitrary DACL write.  License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md.\"\n    reference = \"https://tdm.socprime.com/tdm/info/Q9PtOg89jvkq\"\n    version = \"0.01\"\n    created = \"2019/05/22\"\n    product = \"windows\"\n    service = \"process_creation\"\n    mitre = \"Execution, Privilege Escalation, t1053\"\n\n  events:\n(($selection.metadata.product_event_type = \"1\" or $selection.metadata.product_event_type = \"4688\") and $selection.target.process.command_line = \"schtasks\" and $selection.target.process.command_line = \"/change\" and $selection.target.process.command_line = \"/TN\" and $selection.target.process.command_line = \"/RU\" and $selection.target.process.command_line = \"/RP\")\n\n  condition:\n    $selection\n}\n","reference":["https://tdm.socprime.com/tdm/info/Q9PtOg89jvkq"],"false_positives":[]}}},"__N_SSG":true}