{"pageProps":{"rule":{"metadata":{"updated_date":"2026-04-20T16:36:48.000Z","source_siem":"Google Chronicle","source_siem_id":"chronicle","source_url":"https://github.com/chronicle/detection-rules/blob/main/rules/_deprecated/soc_prime_rules/ioc_sigma/windows/bcdedit_off__sysmon.yaral"},"rule":{"name":"bcdedit off sysmon","description":"Detects usage of bcdedit off.  License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md.","tags":["Rule Type: YARA-L","Domain: Cloud","Data Source: Google SecOps","SIEM: Google Chronicle"],"severity":"medium","risk_score":47,"type":"yara-l","language":"yara-l","query":"rule bcdedit_off_sysmon {\n meta:\n    author = \"Michael Haag, Alexandr Yampolskyi\"\n    description = \"Detects usage of bcdedit off.  License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md.\"\n    reference = \"https://tdm.socprime.com/tdm/info/zyBp9FExBB8I\"\n    version = \"0.01\"\n    created = \"2021-03-09\"\n    product = \"windows\"\n    service = \"sysmon\"\n    mitre = \"Execution, t1204, t1059\"\n\n  events:\n($selection.metadata.product_event_type = \"1\" and $selection.target.process.file.full_path = \"bcdedit.exe\" and re.regex($selection.target.process.command_line, `.*off`))\n\n  condition:\n    $selection\n}\n","reference":["https://tdm.socprime.com/tdm/info/zyBp9FExBB8I"],"false_positives":[]}}},"__N_SSG":true}