{"pageProps":{"rule":{"metadata":{"updated_date":"2026-04-20T16:36:48.000Z","source_siem":"Google Chronicle","source_siem_id":"chronicle","source_url":"https://github.com/chronicle/detection-rules/blob/main/rules/_deprecated/soc_prime_rules/threat_hunting/process_creation/suspicious_compression_tool_parameters.yaral"},"rule":{"name":"suspicious compression tool parameters","description":"Detects suspicious command line arguments of common data compression tools  License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md.","tags":["Rule Type: YARA-L","Domain: Cloud","Data Source: Google SecOps","SIEM: Google Chronicle"],"severity":"medium","risk_score":47,"type":"yara-l","language":"yara-l","query":"rule suspicious_compression_tool_parameters {\n meta:\n    author = \"Florian Roth, Samir Bousseaden\"\n    description = \"Detects suspicious command line arguments of common data compression tools  License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md.\"\n    reference = \"https://tdm.socprime.com/tdm/info/SVetAYGcvAHb\"\n    version = \"0.01\"\n    created = \"2019/10/15\"\n    category = \"process_creation\"\n    product = \"windows\"\n    mitre = \"collection, t1560.001, exfiltration, t1020, t1002\"\n\n  events:\n(((re.regex($falsepositive.target.process.command_line, `.* -p.*`) or re.regex($falsepositive.target.process.command_line, `.* -ta.*`) or re.regex($falsepositive.target.process.command_line, `.* -tb.*`) or re.regex($falsepositive.target.process.command_line, `.* -sdel.*`) or re.regex($falsepositive.target.process.command_line, `.* -dw.*`) or re.regex($falsepositive.target.process.command_line, `.* -hp.*`)) and (re.regex($falsepositive.target.file.full_path, `7z.*\\.exe`) or re.regex($falsepositive.target.file.full_path, `.*rar\\.exe`) or re.regex($falsepositive.target.file.full_path, `.*Command.*Line.*RAR.*`)) and ($falsepositive.metadata.product_event_type = \"4688\" or $falsepositive.metadata.product_event_type = \"1\")) and not (re.regex($falsepositive.principal.process.file.full_path, `C:\\\\Program.*`)))\n\n  condition:\n    $falsepositive\n}\n","reference":["https://tdm.socprime.com/tdm/info/SVetAYGcvAHb"],"false_positives":[]}}},"__N_SSG":true}