{"pageProps":{"rule":{"metadata":{"updated_date":"2026-04-20T16:36:48.000Z","source_siem":"Google Chronicle","source_siem_id":"chronicle","source_url":"https://github.com/chronicle/detection-rules/blob/main/rules/_deprecated/soc_prime_rules/threat_hunting/process_creation/wannacry_ransomware.yaral"},"rule":{"name":"wannacry ransomware","description":"Detects WannaCry ransomware activity  License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md. @c_APT_ure (collection).","tags":["Rule Type: YARA-L","Domain: Cloud","Data Source: Google SecOps","SIEM: Google Chronicle"],"severity":"medium","risk_score":47,"type":"yara-l","language":"yara-l","query":"rule wannacry_ransomware {\n meta:\n    author = \"Florian Roth (rule), Tom U. @c_APT_ure (collection)\"\n    description = \"Detects WannaCry ransomware activity  License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md. @c_APT_ure (collection).\"\n    reference = \"https://tdm.socprime.com/tdm/info/NaLoutAtnhA8\"\n    version = \"0.01\"\n    created = \"2021-03-09\"\n    category = \"process_creation\"\n    product = \"windows\"\n\n  events:\n(($selection1.metadata.product_event_type = \"4688\" or $selection1.metadata.product_event_type = \"1\") and ((re.regex($selection1.target.process.file.full_path, `.*\\\\tasksche\\.exe`) or re.regex($selection1.target.process.file.full_path, `.*\\\\mssecsvc\\.exe`) or re.regex($selection1.target.process.file.full_path, `.*\\\\taskdl\\.exe`) or re.regex($selection1.target.process.file.full_path, `.*\\\\@WanaDecryptor@.*`) or re.regex($selection1.target.process.file.full_path, `.*\\\\WanaDecryptor.*`) or re.regex($selection1.target.process.file.full_path, `.*\\\\taskhsvc\\.exe`) or re.regex($selection1.target.process.file.full_path, `.*\\\\taskse\\.exe`) or re.regex($selection1.target.process.file.full_path, `.*\\\\111\\.exe`) or re.regex($selection1.target.process.file.full_path, `.*\\\\lhdfrgui\\.exe`) or re.regex($selection1.target.process.file.full_path, `.*\\\\diskpart\\.exe`) or re.regex($selection1.target.process.file.full_path, `.*\\\\linuxnew\\.exe`) or re.regex($selection1.target.process.file.full_path, `.*\\\\wannacry\\.exe`)) or (re.regex($selection1.target.process.command_line, `.*icacls .* /grant Everyone:F /T /C /Q.*`) or re.regex($selection1.target.process.command_line, `.*bcdedit /set {default} recoveryenabled no.*`) or re.regex($selection1.target.process.command_line, `.*wbadmin delete catalog -quiet.*`) or re.regex($selection1.target.process.command_line, `.*@Please_Read_Me@\\.txt.*`))))\n\n  condition:\n    $selection1\n}\n","reference":["https://tdm.socprime.com/tdm/info/NaLoutAtnhA8"],"false_positives":[]}}},"__N_SSG":true}