{"pageProps":{"rule":{"metadata":{"updated_date":"2026-04-20T16:36:48.000Z","source_siem":"Google Chronicle","source_siem_id":"chronicle","source_url":"https://github.com/chronicle/detection-rules/blob/main/rules/_deprecated/soc_prime_rules/threat_hunting/process_creation/combination_of__wevtutil_and_fsutil_to_avoid_forensics_analysis.yaral"},"rule":{"name":"combination of  wevtutil and fsutil to avoid forensics analysis","description":"This rule detects the combination of wevtutil and fsutil to avoid forensics analysis  License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md.","tags":["Rule Type: YARA-L","Domain: Cloud","Data Source: Google SecOps","SIEM: Google Chronicle"],"severity":"medium","risk_score":47,"type":"yara-l","language":"yara-l","query":"rule combination_of__wevtutil_and_fsutil_to_avoid_forensics_analysis {\n meta:\n    author = \"Ariel Millahuel\"\n    description = \"This rule detects the combination of wevtutil and fsutil to avoid forensics analysis  License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md.\"\n    reference = \"https://tdm.socprime.com/tdm/info/k1cjcKua96bW\"\n    version = \"0.01\"\n    created = \"2021-03-09\"\n    category = \"process_creation\"\n    product = \"windows\"\n    mitre = \"test_capabilities, t1358\"\n\n  events:\n(($selection1.target.process.file.full_path = \"wevtutil.exe\" or $selection1.target.process.file.full_path = \"fsutil.exe\") and re.regex($selection1.target.process.command_line, `.* wevtutil cl Setup & wevtutil cl System & wevtutil cl Security & wevtutil cl Application & fsutil usn deletejournal /D %.*% .*`) and ($selection1.metadata.product_event_type = \"4688\" or $selection1.metadata.product_event_type = \"1\"))\n\n  condition:\n    $selection1\n}\n","reference":["https://tdm.socprime.com/tdm/info/k1cjcKua96bW"],"false_positives":[]}}},"__N_SSG":true}