{"pageProps":{"rule":{"metadata":{"updated_date":"2026-04-20T16:36:48.000Z","source_siem":"Google Chronicle","source_siem_id":"chronicle","source_url":"https://github.com/chronicle/detection-rules/blob/main/rules/_deprecated/soc_prime_rules/threat_hunting/process_creation/loda_rat_detection.yaral"},"rule":{"name":"loda rat detection","description":"Loda is a Remote Access Trojan with spying capabilities  License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md.","tags":["Rule Type: YARA-L","Domain: Cloud","Data Source: Google SecOps","SIEM: Google Chronicle"],"severity":"medium","risk_score":47,"type":"yara-l","language":"yara-l","query":"rule loda_rat_detection {\n meta:\n    author = \"Ariel Millahuel\"\n    description = \"Loda is a Remote Access Trojan with spying capabilities  License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md.\"\n    reference = \"https://tdm.socprime.com/tdm/info/yO2dtTK5tKlD\"\n    version = \"0.01\"\n    created = \"2021-03-09\"\n    category = \"process_creation\"\n    product = \"windows\"\n    mitre = \"execution, T1059\"\n\n  events:\n($selection1.target.process.file.full_path = \"cmd.exe\" and (re.regex($selection1.target.process.command_line, `cmd\\.exe & /C CD C:/ & msiexec\\.exe /i http.*://lcodigo\\.com/apiW/config/uploads/tmp/.*\\.msi /quiet`) or re.regex($selection1.target.process.command_line, `cmd\\.exe & /C CD C:/ & msiexec\\.exe /i http.*://.*\\.com/api.*/config/uploads/tmp/.*\\.msi /quiet`)) and ($selection1.metadata.product_event_type = \"4688\" or $selection1.metadata.product_event_type = \"1\"))\n\n  condition:\n    $selection1\n}\n","reference":["https://tdm.socprime.com/tdm/info/yO2dtTK5tKlD"],"false_positives":[]}}},"__N_SSG":true}