{"pageProps":{"rule":{"metadata":{"updated_date":"2026-04-20T16:36:48.000Z","source_siem":"Google Chronicle","source_siem_id":"chronicle","source_url":"https://github.com/chronicle/detection-rules/blob/main/rules/_deprecated/soc_prime_rules/active_directory_security/windows/active_directory_replication_from_non_machine_account.yaral"},"rule":{"name":"active directory replication from non machine account","description":"Detects potential abuse of Active Directory Replication Service (ADRS) from a non machine account to request credentials.  License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md.","tags":["Rule Type: YARA-L","Domain: Cloud","Data Source: Google SecOps","SIEM: Google Chronicle"],"severity":"medium","risk_score":47,"type":"yara-l","language":"yara-l","query":"rule active_directory_replication_from_non_machine_account {\n meta:\n    author = \"Roberto Rodriguez @Cyb3rWard0g\"\n    description = \"Detects potential abuse of Active Directory Replication Service (ADRS) from a non machine account to request credentials.  License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md.\"\n    reference = \"https://tdm.socprime.com/tdm/info/jTwsuQPYgYcP\"\n    version = \"0.01\"\n    created = \"2019/07/26\"\n    product = \"windows\"\n    service = \"security\"\n    mitre = \"credential_access, t1003\"\n\n  events:\n(($selection.metadata.product_event_type = \"4662\" and $selection.target.process.access_mask = \"0x100\" and (re.regex($selection.target.process.file.file_metadata.pe.import_hash, `.*1131f6aa-9c07-11d1-f79f-00c04fc2dcd2.*`) or re.regex($selection.target.process.file.file_metadata.pe.import_hash, `.*1131f6ad-9c07-11d1-f79f-00c04fc2dcd2.*`) or re.regex($selection.target.process.file.file_metadata.pe.import_hash, `.*89e95b76-444d-4c62-991a-0facbeda640c.*`))) and not (re.regex($selection.principal.user.user_display_name, `.*$`)))\n\n  condition:\n    $selection\n}\n","reference":["https://tdm.socprime.com/tdm/info/jTwsuQPYgYcP"],"false_positives":[]}}},"__N_SSG":true}