{"pageProps":{"rule":{"metadata":{"updated_date":"2026-04-20T16:36:48.000Z","source_siem":"Google Chronicle","source_siem_id":"chronicle","source_url":"https://github.com/chronicle/detection-rules/blob/main/rules/_deprecated/soc_prime_rules/ioc_sigma/windows/danabot_trojan__sysmon.yaral"},"rule":{"name":"danabot trojan sysmon","description":"DanaBot, a stealthy banking Trojan.  License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md.","tags":["Rule Type: YARA-L","Domain: Cloud","Data Source: Google SecOps","SIEM: Google Chronicle"],"severity":"medium","risk_score":47,"type":"yara-l","language":"yara-l","query":"rule danabot_trojan_sysmon {\n meta:\n    author = \"Alexandr Yampolskyi, SOC Prime\"\n    description = \"DanaBot, a stealthy banking Trojan.  License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md.\"\n    reference = \"https://tdm.socprime.com/tdm/info/2mQEBdEK2hMS\"\n    version = \"0.01\"\n    created = \"2019/01/09\"\n    product = \"windows\"\n    service = \"sysmon\"\n    mitre = \"Execution, t1204\"\n\n  events:\n($selection.metadata.product_event_type = \"1\" and $selection.target.file.md5 = \"76A64FD17CD1E7C59B8BDE7AA9209854\")\n\n  condition:\n    $selection\n}\n","reference":["https://tdm.socprime.com/tdm/info/2mQEBdEK2hMS"],"false_positives":[]}}},"__N_SSG":true}