{"pageProps":{"rule":{"metadata":{"updated_date":"2026-05-26T17:34:32.000Z","source_siem":"Google Chronicle","source_siem_id":"chronicle","source_url":"https://github.com/chronicle/detection-rules/blob/main/rules/_deprecated/soc_prime_rules/threat_hunting/process_creation/stop_ransomware_and_vidar_ransomware_detection.yaral"},"rule":{"name":"stop ransomware and vidar ransomware detection","description":"This rule detects the behavior of a combination between STOP Ransomware and Vidar Ransomware. Both threats are used in combination in order to steal information after a phishing attack was succesfully executed  License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md.","tags":["Rule Type: YARA-L","Domain: Cloud","Data Source: Google SecOps","SIEM: Google Chronicle"],"severity":"medium","risk_score":47,"type":"yara-l","language":"yara-l","query":"rule stop_ransomware_and_vidar_ransomware_detection {\n meta:\n    author = \"Ariel Millahuel\"\n    description = \"This rule detects the behavior of a combination between STOP Ransomware and Vidar Ransomware. Both threats are used in combination in order to steal information after a phishing attack was succesfully executed  License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md.\"\n    reference = \"https://tdm.socprime.com/tdm/info/eLntKUKd5pKY\"\n    version = \"0.01\"\n    created = \"2021-03-09\"\n    category = \"process_creation\"\n    product = \"windows\"\n    mitre = \"execution, T1059\"\n\n  events:\n(($selection1.metadata.product_event_type = \"4688\" or $selection1.metadata.product_event_type = \"1\") and (($selection1.target.process.file.full_path = \"cmd.exe\" and (re.regex($selection1.target.process.command_line, `/c taskkill /im 5\\.exe /f & erase C:\\\\Users.*\\\\AppData\\\\Local\\\\Temp.*\\\\5\\.exe & exit`) or re.regex($selection1.target.process.command_line, `/c taskkill /im .*\\.exe /f & erase C:\\\\Users.*\\\\AppData\\\\Local\\\\Temp.*.*\\.exe & exit`))) or ($selection1.target.process.file.full_path = \"icacls.exe\" and re.regex($selection1.target.process.command_line, `icacls C:\\\\Users.*\\\\AppData\\\\Local.*\\\\deny .*S-1-1-0:\\(Ol\\)\\(Cl\\)\\(DE,DC\\)`))))\n\n  condition:\n    $selection1\n}\n","reference":["https://tdm.socprime.com/tdm/info/eLntKUKd5pKY"],"false_positives":[]}}},"__N_SSG":true}