{"pageProps":{"rule":{"metadata":{"updated_date":"2026-05-26T17:34:32.000Z","source_siem":"Google Chronicle","source_siem_id":"chronicle","source_url":"https://github.com/chronicle/detection-rules/blob/main/rules/_deprecated/soc_prime_rules/threat_hunting/process_creation/wmi_persistence___script_event_consumer.yaral"},"rule":{"name":"wmi persistence  script event consumer","description":"Detects WMI script event consumers  License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md.","tags":["Rule Type: YARA-L","Domain: Cloud","Data Source: Google SecOps","SIEM: Google Chronicle"],"severity":"medium","risk_score":47,"type":"yara-l","language":"yara-l","query":"rule wmi_persistence__script_event_consumer {\n meta:\n    author = \"Thomas Patzke\"\n    description = \"Detects WMI script event consumers  License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md.\"\n    reference = \"https://tdm.socprime.com/tdm/info/ZTH6LrhoZVOS\"\n    version = \"0.01\"\n    created = \"2018/03/07\"\n    category = \"process_creation\"\n    product = \"windows\"\n    mitre = \"execution, persistence, t1047\"\n\n  events:\n($selection.target.process.file.full_path = \"C:\\\\WINDOWS\\\\system32\\\\wbem\\\\scrcons.exe\" and $selection.principal.process.file.full_path = \"C:\\\\Windows\\\\System32\\\\svchost.exe\" and ($selection.metadata.product_event_type = \"4688\" or $selection.metadata.product_event_type = \"1\"))\n\n  condition:\n    $selection\n}\n","reference":["https://tdm.socprime.com/tdm/info/ZTH6LrhoZVOS"],"false_positives":[]}}},"__N_SSG":true}