{"pageProps":{"rule":{"metadata":{"updated_date":"2026-05-26T17:34:32.000Z","source_siem":"Google Chronicle","source_siem_id":"chronicle","source_url":"https://github.com/chronicle/detection-rules/blob/main/rules/_deprecated/soc_prime_rules/ioc_sigma/windows/betabot__neurevt___sysmon.yaral"},"rule":{"name":"betabot neurevt sysmon","description":"BetaBot is a stealer software.  License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md.","tags":["Rule Type: YARA-L","Domain: Cloud","Data Source: Google SecOps","SIEM: Google Chronicle"],"severity":"medium","risk_score":47,"type":"yara-l","language":"yara-l","query":"rule betabot_neurevt_sysmon {\n meta:\n    author = \"Alexandr Yampolskyi, SOC Prime\"\n    description = \"BetaBot is a stealer software.  License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md.\"\n    reference = \"https://tdm.socprime.com/tdm/info/t7qirtXwX0n2\"\n    version = \"0.01\"\n    created = \"2019/01/13\"\n    product = \"windows\"\n    service = \"sysmon\"\n    mitre = \"Execution, t1204\"\n\n  events:\n($selection.metadata.product_event_type = \"1\" and ($selection.target.file.md5 = \"b4576437f4b06d438a03a9f8f0776cde\" or $selection.target.file.md5 = \"a0763d3332bb87595ed6303ab3cdb8fff7dd1e976ee161003a62316fea332941\"))\n\n  condition:\n    $selection\n}\n","reference":["https://tdm.socprime.com/tdm/info/t7qirtXwX0n2"],"false_positives":[]}}},"__N_SSG":true}