{"pageProps":{"rule":{"metadata":{"updated_date":"2026-05-26T17:34:32.000Z","source_siem":"Google Chronicle","source_siem_id":"chronicle","source_url":"https://github.com/chronicle/detection-rules/blob/main/rules/_deprecated/soc_prime_rules/ioc_sigma/sysmon/psexec_process_has_terminated.yaral"},"rule":{"name":"psexec process has terminated","description":"This detects when PsExec's process ends.  License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md.","tags":["Rule Type: YARA-L","Domain: Cloud","Data Source: Google SecOps","SIEM: Google Chronicle"],"severity":"medium","risk_score":47,"type":"yara-l","language":"yara-l","query":"rule psexec_process_has_terminated {\n meta:\n    author = \"Lee Archinal\"\n    description = \"This detects when PsExec's process ends.  License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md.\"\n    reference = \"https://tdm.socprime.com/tdm/info/ciE6swnMJ5Xh\"\n    version = \"0.01\"\n    created = \"2019/04/29\"\n    product = \"windows\"\n    service = \"sysmon\"\n    mitre = \"Defense_evasion, t1112, Execution, t1059\"\n\n  events:\n($selection.metadata.product_event_type = \"5\" and re.regex($selection.target.process.file.full_path, `.*\\\\psexec\\.exe`))\n\n  condition:\n    $selection\n}\n","reference":["https://tdm.socprime.com/tdm/info/ciE6swnMJ5Xh"],"false_positives":[]}}},"__N_SSG":true}