{"pageProps":{"rule":{"metadata":{"updated_date":"2026-05-26T17:34:32.000Z","source_siem":"Google Chronicle","source_siem_id":"chronicle","source_url":"https://github.com/chronicle/detection-rules/blob/main/rules/_deprecated/soc_prime_rules/threat_hunting/process_creation/suspicious_reconnaissance_activity.yaral"},"rule":{"name":"suspicious reconnaissance activity","description":"Detects suspicious command line activity on Windows systems  License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md.","tags":["Rule Type: YARA-L","Domain: Cloud","Data Source: Google SecOps","SIEM: Google Chronicle"],"severity":"medium","risk_score":47,"type":"yara-l","language":"yara-l","query":"rule suspicious_reconnaissance_activity {\n meta:\n    author = \"Florian Roth\"\n    description = \"Detects suspicious command line activity on Windows systems  License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md.\"\n    reference = \"https://tdm.socprime.com/tdm/info/1H6XajuNzAYw\"\n    version = \"0.01\"\n    created = \"2021-03-09\"\n    category = \"process_creation\"\n    product = \"windows\"\n\n  events:\n(($selection.target.process.command_line = \"net group \\\"domain admins\\\" /domain\" or $selection.target.process.command_line = \"net localgroup administrators\") and ($selection.metadata.product_event_type = \"4688\" or $selection.metadata.product_event_type = \"1\"))\n\n  condition:\n    $selection\n}\n","reference":["https://tdm.socprime.com/tdm/info/1H6XajuNzAYw"],"false_positives":[]}}},"__N_SSG":true}