{"pageProps":{"rule":{"metadata":{"bypass_bbr_timing":true,"creation_date":"2026/05/04","integration":["kubernetes"],"maturity":"production","updated_date":"2026/05/04","source_siem":"Elastic","source_siem_id":"elastic"},"rule":{"author":["Elastic"],"building_block_type":"default","description":"Detects successful Kubernetes pod creation requests using commonly abused base and debugging container\nimages such as BusyBox, Alpine, Ubuntu, Netshoot, and network multitool variants. These images are\nfrequently used by attackers to deploy short-lived or interactive \"throwaway\" containers for\nreconnaissance, payload staging, or command execution due to their small footprint or built-in tooling.\n","index":["logs-kubernetes.audit_logs-*"],"language":"kuery","license":"Elastic License v2","name":"Kubernetes Pod Creation Using Common Debug or Base Images","risk_score":21,"rule_id":"93120a05-caf5-47f6-a305-e8abee463fb9","severity":"low","tags":["Data Source: Kubernetes","Domain: Kubernetes","Use Case: Threat Detection","Tactic: Execution","Tactic: Defense Evasion","Rule Type: BBR"],"timestamp_override":"event.ingested","type":"new_terms","query":"event.dataset:\"kubernetes.audit_logs\" and\nkubernetes.audit.stage:\"ResponseComplete\" and\nkubernetes.audit.annotations.authorization_k8s_io/decision:\"allow\" and\nkubernetes.audit.objectRef.resource:\"pods\" and\nkubernetes.audit.verb:\"create\" and\nkubernetes.audit.requestObject.spec.containers.image:(alpine* or busybox* or ubuntu\\:* or debian\\:* or *netshoot\\:* or *network-multitool\\:* or *curl\\:*)\n","threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0002","name":"Execution","reference":"https://attack.mitre.org/tactics/TA0002/"},"technique":[{"id":"T1610","name":"Deploy Container","reference":"https://attack.mitre.org/techniques/T1610/"},{"id":"T1609","name":"Container Administration Command","reference":"https://attack.mitre.org/techniques/T1609/"}]},{"framework":"MITRE ATT&CK","tactic":{"id":"TA0005","name":"Defense Evasion","reference":"https://attack.mitre.org/tactics/TA0005/"},"technique":[{"id":"T1610","name":"Deploy Container","reference":"https://attack.mitre.org/techniques/T1610/"}]}],"new_terms":{"field":"new_terms_fields","value":["source.ip","user_agent.original","user.name"],"history_window_start":[{"field":"history_window_start","value":"now-5d"}]}}}},"__N_SSG":true}