{"pageProps":{"rule":{"metadata":{"updated_date":"2026-05-26T17:34:32.000Z","source_siem":"Google Chronicle","source_siem_id":"chronicle","source_url":"https://github.com/chronicle/detection-rules/blob/main/rules/_deprecated/soc_prime_rules/threat_hunting/process_creation/execution_in_non_executable_folder.yaral"},"rule":{"name":"execution in nonexecutable folder","description":"Detects a suspicious exection from an uncommon folder  License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md.","tags":["Rule Type: YARA-L","Domain: Cloud","Data Source: Google SecOps","SIEM: Google Chronicle"],"severity":"medium","risk_score":47,"type":"yara-l","language":"yara-l","query":"rule execution_in_nonexecutable_folder {\n meta:\n    author = \"Florian Roth\"\n    description = \"Detects a suspicious exection from an uncommon folder  License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md.\"\n    reference = \"https://tdm.socprime.com/tdm/info/RVIFEay7irsd\"\n    version = \"0.01\"\n    created = \"2021-03-09\"\n    category = \"process_creation\"\n    product = \"windows\"\n    mitre = \"defense_evasion, t1036\"\n\n  events:\n((re.regex($selection.target.process.file.full_path, `.*\\\\$Recycle\\.bin`) or re.regex($selection.target.process.file.full_path, `.*\\\\Users\\\\All Users\\\\.*`) or re.regex($selection.target.process.file.full_path, `.*\\\\Users\\\\Default\\\\.*`) or re.regex($selection.target.process.file.full_path, `.*\\\\Users\\\\Public\\\\.*`) or re.regex($selection.target.process.file.full_path, `C:\\\\Perflogs\\\\.*`) or re.regex($selection.target.process.file.full_path, `.*\\\\config\\\\systemprofile\\\\.*`) or re.regex($selection.target.process.file.full_path, `.*\\\\Windows\\\\Fonts\\\\.*`) or re.regex($selection.target.process.file.full_path, `.*\\\\Windows\\\\IME\\\\.*`) or re.regex($selection.target.process.file.full_path, `.*\\\\Windows\\\\addins\\\\.*`)) and ($selection.metadata.product_event_type = \"4688\" or $selection.metadata.product_event_type = \"1\"))\n\n  condition:\n    $selection\n}\n","reference":["https://tdm.socprime.com/tdm/info/RVIFEay7irsd"],"false_positives":[]}}},"__N_SSG":true}