{"pageProps":{"rule":{"metadata":{"updated_date":"2026-04-20T16:36:48.000Z","source_siem":"Google Chronicle","source_siem_id":"chronicle","source_url":"https://github.com/chronicle/detection-rules/blob/main/rules/_deprecated/soc_prime_rules/ioc_sigma/sysmon/modification_of_windows_defender_service_settings__sysmon.yaral"},"rule":{"name":"modification of windows defender service settings sysmon","description":"Detects modifications on Windows Defender Settings via Registry keys/values  License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md.","tags":["Rule Type: YARA-L","Domain: Cloud","Data Source: Google SecOps","SIEM: Google Chronicle"],"severity":"medium","risk_score":47,"type":"yara-l","language":"yara-l","query":"rule modification_of_windows_defender_service_settings_sysmon {\n meta:\n    author = \"Ariel Millahuel\"\n    description = \"Detects modifications on Windows Defender Settings via Registry keys/values  License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md.\"\n    reference = \"https://tdm.socprime.com/tdm/info/EVsw1o6LJTlk\"\n    version = \"0.01\"\n    created = \"2021-03-09\"\n    product = \"windows\"\n    service = \"sysmon\"\n    mitre = \"defense_evasion, t1036\"\n\n  events:\n(($selection1.metadata.product_event_type = \"13\" and (re.regex($selection1.target.registry.registry_key, `.*\\\\SYSTEM\\\\ControlSet001\\\\services\\\\WinDefend`) or re.regex($selection1.target.registry.registry_key, `.*SOFTWARE\\\\Policies\\\\Microsoft\\\\Windows Defender`)) and $selection1.metadata.event_type = \"SetValue\") or ($selection1.target.process.file.full_path = \"powershell.exe\" and re.regex($selection1.target.process.command_line, `.* .*/c powershell Set-MpPreference -DisableRealtimeMonitoring $true  .*`)))\n\n  condition:\n    $selection1\n}\n","reference":["https://tdm.socprime.com/tdm/info/EVsw1o6LJTlk"],"false_positives":[]}}},"__N_SSG":true}