{"pageProps":{"rule":{"metadata":{"updated_date":"2026-05-26T17:34:32.000Z","source_siem":"Google Chronicle","source_siem_id":"chronicle","source_url":"https://github.com/chronicle/detection-rules/blob/main/rules/_deprecated/soc_prime_rules/threat_hunting/process_creation/powershell_download_from_url.yaral"},"rule":{"name":"powershell download from url","description":"Detects a Powershell process that contains download commands in its command line string  License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md.","tags":["Rule Type: YARA-L","Domain: Cloud","Data Source: Google SecOps","SIEM: Google Chronicle"],"severity":"medium","risk_score":47,"type":"yara-l","language":"yara-l","query":"rule powershell_download_from_url {\n meta:\n    author = \"Florian Roth\"\n    description = \"Detects a Powershell process that contains download commands in its command line string  License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md.\"\n    reference = \"https://tdm.socprime.com/tdm/info/7h2cvCX8ofdj\"\n    version = \"0.01\"\n    created = \"2021-03-09\"\n    category = \"process_creation\"\n    product = \"windows\"\n    mitre = \"t1086, execution\"\n\n  events:\n(re.regex($selection.target.process.file.full_path, `.*\\\\powershell\\.exe`) and (re.regex($selection.target.process.command_line, `.*new-object system\\.net\\.webclient\\)\\.downloadstring\\(.*`) or re.regex($selection.target.process.command_line, `.*new-object system\\.net\\.webclient\\)\\.downloadfile\\(.*`) or re.regex($selection.target.process.command_line, `.*new-object net\\.webclient\\)\\.downloadstring\\(.*`) or re.regex($selection.target.process.command_line, `.*new-object net\\.webclient\\)\\.downloadfile\\(.*`)) and ($selection.metadata.product_event_type = \"4688\" or $selection.metadata.product_event_type = \"1\"))\n\n  condition:\n    $selection\n}\n","reference":["https://tdm.socprime.com/tdm/info/7h2cvCX8ofdj"],"false_positives":[]}}},"__N_SSG":true}