{"pageProps":{"rule":{"metadata":{"updated_date":"2026-05-26T17:34:32.000Z","source_siem":"Google Chronicle","source_siem_id":"chronicle","source_url":"https://github.com/chronicle/detection-rules/blob/main/rules/_deprecated/soc_prime_rules/active_directory_security/process_creation/invocation_of_active_directory_diagnostic_tool__ntdsutil_exe.yaral"},"rule":{"name":"invocation of active directory diagnostic tool ntdsutilexe","description":"Detects execution of ntdsutil.exe, which can be used for various attacks against the NTDS database (NTDS.DIT)  License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md.","tags":["Rule Type: YARA-L","Domain: Cloud","Data Source: Google SecOps","SIEM: Google Chronicle"],"severity":"medium","risk_score":47,"type":"yara-l","language":"yara-l","query":"rule invocation_of_active_directory_diagnostic_tool_ntdsutilexe {\n meta:\n    author = \"Thomas Patzke\"\n    description = \"Detects execution of ntdsutil.exe, which can be used for various attacks against the NTDS database (NTDS.DIT)  License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md.\"\n    reference = \"https://tdm.socprime.com/tdm/info/WeCGGZ763x50\"\n    version = \"0.01\"\n    created = \"2021-03-09\"\n    category = \"process_creation\"\n    product = \"windows\"\n    mitre = \"credential_access, t1003\"\n\n  events:\n(re.regex($selection.target.process.command_line, `.*\\\\ntdsutil.*`) and ($selection.metadata.product_event_type = \"4688\" or $selection.metadata.product_event_type = \"1\"))\n\n  condition:\n    $selection\n}\n","reference":["https://tdm.socprime.com/tdm/info/WeCGGZ763x50"],"false_positives":[]}}},"__N_SSG":true}