{"pageProps":{"rule":{"metadata":{"updated_date":"2026-05-26T17:34:32.000Z","source_siem":"Google Chronicle","source_siem_id":"chronicle","source_url":"https://github.com/chronicle/detection-rules/blob/main/rules/_deprecated/soc_prime_rules/threat_hunting/file_event/malicious_behaviour_on_user_login__microsoft_windows___c0d0s0_group_behavior_part_1.yaral"},"rule":{"name":"malicious behaviour on user login microsoft windows  c0d0s0 group behavior","description":"Detects malicious registry values and unusual AppData folder modification related also to c0d0s0 group.  License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md.","tags":["Rule Type: YARA-L","Domain: Cloud","Data Source: Google SecOps","SIEM: Google Chronicle"],"severity":"medium","risk_score":47,"type":"yara-l","language":"yara-l","query":"rule malicious_behaviour_on_user_login_microsoft_windows__c0d0s0_group_behavior {\n meta:\n    author = \"Ariel Millahuel\"\n    description = \"Detects malicious registry values and unusual AppData folder modification related also to c0d0s0 group.  License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md.\"\n    reference = \"https://tdm.socprime.com/tdm/info/L7ZaPMOEyDMa\"\n    version = \"0.01\"\n    created = \"2019/11/21\"\n    product = \"windows\"\n    category = \"registry_event\"\n    mitre = \"persistence, privilege_escalation, t1112, t1547, t1547.001\"\n\n  events:\n($selection1.metadata.event_type = \"SetValue\" and (re.regex($selection1.target.registry.registry_key, `.*\\\\CurrentVersion\\\\Run\\\\Windows Debug Tools.*`) or (re.regex($selection1.target.registry.registry_key, `.*\\\\CurrentVersion\\\\SvcHost\\\\netsvcs.*`) or re.regex($selection1.target.registry.registry_key, `.*\\\\Dncp\\\\Parameters\\\\ServiceDll.*`))))\n\n  condition:\n    $selection1\n}\n","reference":["https://tdm.socprime.com/tdm/info/L7ZaPMOEyDMa"],"false_positives":[]}}},"__N_SSG":true}