{"pageProps":{"rule":{"metadata":{"updated_date":"2026-05-26T17:34:32.000Z","source_siem":"Google Chronicle","source_siem_id":"chronicle","source_url":"https://github.com/chronicle/detection-rules/blob/main/rules/_deprecated/soc_prime_rules/threat_hunting/process_creation/execution_in_outlook_temp_folder.yaral"},"rule":{"name":"execution in outlook temp folder","description":"Detects a suspicious program execution in Outlook temp folder  License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md.","tags":["Rule Type: YARA-L","Domain: Cloud","Data Source: Google SecOps","SIEM: Google Chronicle"],"severity":"medium","risk_score":47,"type":"yara-l","language":"yara-l","query":"rule execution_in_outlook_temp_folder {\n meta:\n    author = \"Florian Roth\"\n    description = \"Detects a suspicious program execution in Outlook temp folder  License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md.\"\n    reference = \"https://tdm.socprime.com/tdm/info/TTOs3evZRJww\"\n    version = \"0.01\"\n    created = \"2019/10/01\"\n    category = \"process_creation\"\n    product = \"windows\"\n    mitre = \"initial_access, t1193\"\n\n  events:\n(re.regex($selection.target.process.file.full_path, `.*\\\\Temporary Internet Files\\\\Content\\.Outlook\\\\.*`) and ($selection.metadata.product_event_type = \"4688\" or $selection.metadata.product_event_type = \"1\"))\n\n  condition:\n    $selection\n}\n","reference":["https://tdm.socprime.com/tdm/info/TTOs3evZRJww"],"false_positives":[]}}},"__N_SSG":true}