{"pageProps":{"rule":{"metadata":{"updated_date":"2026-05-26T17:34:32.000Z","source_siem":"Google Chronicle","source_siem_id":"chronicle","source_url":"https://github.com/chronicle/detection-rules/blob/main/rules/_deprecated/mitre_attack/T1548_002_windows_uac_bypass.yaral"},"rule":{"name":"mitre attack T1548 002 windows uac bypass","description":"Net use commands for SMB/Windows admin shares","tags":["Rule Type: YARA-L","Domain: Cloud","Data Source: Google SecOps","SIEM: Google Chronicle"],"severity":"medium","risk_score":47,"type":"yara-l","language":"yara-l","query":"/*\n * Copyright 2021 Google LLC\n *\n * Licensed under the Apache License, Version 2.0 (the \"License\");\n * you may not use this file except in compliance with the License.\n * You may obtain a copy of the License at\n *\n *     https://www.apache.org/licenses/LICENSE-2.0\n *\n * Unless required by applicable law or agreed to in writing, software\n * distributed under the License is distributed on an \"AS IS\" BASIS,\n * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.\n * See the License for the specific language governing permissions and\n * limitations under the License.\n */\n\nrule mitre_attack_T1548_002_windows_uac_bypass\n{\n  meta:\n    author = \"Google Cloud Security\"\n    description = \"Net use commands for SMB/Windows admin shares\"\n    reference = \"https://attack.mitre.org/techniques/T1021/002/\"\n    yara_version = \"YL2.0\"\n    rule_version = \"1.0\"\n\n  events:\n    (\n      $e1.metadata.event_type = \"PROCESS_LAUNCH\" and\n      re.regex($e1.principal.process.command_line, `reg\\.exe add hkcu\\\\software\\\\classes\\\\mscfile\\\\shell\\\\open\\\\command /ve /d.* /f`) nocase\n    )\n    or\n    (\n      re.regex($e1.principal.process.command_line, `powershell.exe`) nocase and\n      re.regex($e1.target.registry.registry_key, `\\\\software\\\\classes\\\\mscfile\\\\shell\\\\open\\\\command`) nocase\n    )\n\n  condition:\n    $e1\n}\n","reference":["https://attack.mitre.org/techniques/T1021/002/"],"false_positives":[]}}},"__N_SSG":true}