{"pageProps":{"rule":{"metadata":{"updated_date":"2026-05-26T17:34:32.000Z","source_siem":"Google Chronicle","source_siem_id":"chronicle","source_url":"https://github.com/chronicle/detection-rules/blob/main/rules/_deprecated/soc_prime_rules/threat_hunting/process_creation/possible_shim_database_persistence_via_sdbinst_exe.yaral"},"rule":{"name":"possible shim database persistence via sdbinstexe","description":"Detects installation of a new shim using sdbinst.exe. A shim can be used to load malicious DLLs into applications.  License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md.","tags":["Rule Type: YARA-L","Domain: Cloud","Data Source: Google SecOps","SIEM: Google Chronicle"],"severity":"medium","risk_score":47,"type":"yara-l","language":"yara-l","query":"rule possible_shim_database_persistence_via_sdbinstexe {\n meta:\n    author = \"Markus Neis, Den Iuzvyk\"\n    description = \"Detects installation of a new shim using sdbinst.exe. A shim can be used to load malicious DLLs into applications.  License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md.\"\n    reference = \"https://tdm.socprime.com/tdm/info/BUTmMgSdr90c\"\n    version = \"0.01\"\n    created = \"2019/01/16\"\n    category = \"process_creation\"\n    product = \"windows\"\n    mitre = \"persistence, t1138\"\n\n  events:\n(re.regex($selection.target.process.file.full_path, `.*\\\\sdbinst\\.exe`) and ($selection.target.process.command_line = \"-q\" or $selection.target.process.command_line = \"-p\") and ($selection.metadata.product_event_type = \"4688\" or $selection.metadata.product_event_type = \"1\"))\n\n  condition:\n    $selection\n}\n","reference":["https://tdm.socprime.com/tdm/info/BUTmMgSdr90c"],"false_positives":[]}}},"__N_SSG":true}